Revit 2024 API
Surface.Project Method
 Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public void Project(
	XYZ point,
	out UV uv,
	out double distance
)
Visual Basic
Public Sub Project ( _
	point As XYZ, _
	<OutAttribute> ByRef uv As UV, _
	<OutAttribute> ByRef distance As Double _
)
Visual C++
public:
void Project(
	XYZ^ point,
	[OutAttribute] UV^% uv,
	[OutAttribute] double% distance
)
Parameters
point
Type: Autodesk.Revit.DB.XYZ
 The point to project.
uv
Type: Autodesk.Revit.DB.UV
 The surface coordinates of the projected point.
distance
Type: System.Double
 Holds the distance from input point to its projection.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The projection failed.
See Also
Surface Class
Autodesk.Revit.DB Namespace